Repository: prasos/insight-ui
Catalog: po/*.po
Languages: fi

source: (Input unconfirmed)
fi: (Sisääntulo vahvistamaton)

source: 404 Page not found :(
fi: 404 Sivua ei löytynyt :(

source: <strong>insight</strong> is an <a href="https://insight.is/" target="_blank">open-source Bitcoin blockchain explorer</a> with complete REST and websocket APIs that can be used for writing web wallets and other apps that need more advanced blockchain queries than provided by bitcoind RPC. Check out the <a href="http://github.com/bitpay/insight" target="_blank">source code</a>.
fi: <strong>Lohkoketju.fi</strong> on ilmainen ja helppokäyttöinen lohkoketjuselain Bitcoinille. Palvelu tarjoaa ajantasaisen Bitcoinin lohkoketjun selaamisen suomen kielellä.

source: <strong>insight</strong> is still in development, so be sure to report any bugs and provide feedback for improvement at our <a href="https://github.com/bitpay/insight/issues" target="_blank">github issue tracker</a>.
fi: Tämän palvelun tarjoaa <strong><a href="https://bittiraha.fi/" target="_blank">Bittiraha.fi</a> / <a href="https://prasos.fi" target="_blank">Prasos Oy</a></strong> ja palvelu on vielä kehitysvaiheessa.

source: About
fi: Lisätietoja

source: Address
fi: Osoite

source: Age
fi: Ikä

source: An error occured in the verification process.
fi: Tarkastusprosessissa tapahtui virhe.

source: An error occured:<br>{{error}}
fi: Tapahtui virhe:<br>{{error}}

source: Application Status
fi: Sovelluksen tila

source: Best Block
fi: Paras lohko

source: Bitcoin comes with a way of signing arbitrary messages.
fi: Bitcoinilla voit allekirjoittaa viestejä.

source: Bitcoin node information
fi: Bitcoin-noodin tiedot

source: Block
fi: Lohko

source: Block Reward
fi: Lohkopalkkio

source: Blocks
fi: Lohkot

source: Broadcast Raw Transaction
fi: Kuuluta raaka siirto

source: Bytes Serialized
fi: Sarjallisetut tavut

source: Can't connect to bitcoind to get live updates from the p2p network. (Tried connecting to bitcoind at {{host}}:{{port}} and failed.)
fi: Yhteyttä bitcoind:hen ei voitu muodostaa. (Yhteys kohteeseen {{host}}:{{port}} epäonnistui.)

source: Can't connect to insight server. Attempting to reconnect...
fi: Yhteyttä insight-palvelimeen ei saatu. Yritetään uudelleen...

source: Can't connect to internet. Please, check your connection.
fi: Ei internetyhteyttä.

source: Complete
fi: Valmiina

source: Confirmations
fi: Vahvistusten lukumäärä

source: Conn
fi: Yhteyksiä

source: Connections to other nodes
fi: Yhteyksien määrä muihin noodeihin

source: Current Sync Status
fi: Synkronoinnin tila

source: Details
fi: Yksityiskohdat

source: Difficulty
fi: Vaikeustaso

source: Double spent attempt detected. From tx:
fi: Kaksoiskulutusyritys havaittu. tx:

source: Error message:
fi: Virhe:

source: Error!
fi: Virhe!

source: Fee
fi: Palkkio

source: Fee Rate
fi: Palkkio

source: Final Balance
fi: Lopullinen kate

source: Finish Date
fi: Valmistumisaika

source: Go to home
fi: Palaa alkuun

source: Hash Serialized
fi: Sarjallistettu tiiviste

source: Height
fi: Lohko

source: Included in Block
fi: Sisältyy lohkoon

source: Incoherence in levelDB detected:
fi: Ristiriitaisuus levelDB:ssä havaittu

source: Info Errors
fi: Info-virheitä

source: Initial Block Chain Height
fi: Alkuperäisen lohkoketjun korkeus

source: Input
fi: Sisääntulo

source: Last Block
fi: Viimeisin lohko

source: Last Block Hash (Bitcoind)
fi: Viimeisimmän lohkon tiiviste (Bitcoind)

source: Latest Blocks
fi: Viimeisimmät lohkot

source: Latest Transactions
fi: Viimeisimmät siirrot

source: Loading Address Information
fi: Ladataan Osoitetietoja

source: Loading Block Information
fi: Ladataan lohkotietoja

source: Loading Selected Date...
fi: Ladataan valittua päivämäärää...

source: Loading Transaction Details
fi: Ladataan siirron yksityiskohtia

source: Loading Transactions...
fi: Ladataan siirtoja...

source: Loading...
fi: Ladataan...

source: Message
fi: Viesti

source: Mined Time
fi: Louhinta-aika

source: Mined by
fi: Louhija

source: Mining Difficulty
fi: Louhinnan vaikeusaste

source: Next Block
fi: Seuraava lohko

source: No Inputs (Newly Generated Coins)
fi: Ei sisääntuloja (juuri luotuja kolikoita)

source: No blocks yet.
fi: Ei lohkoja vielä.

source: No matching records found!
fi: Vastaavaa tallennetta ei löytynyt!

source: No. Transactions
fi: Siirtojen lukumäärä

source: Number Of Transactions
fi: Siirtojen lukumäärä

source: Output
fi: Lähtö

source: Powered by
fi: Palvelun tarjoaa

source: Previous Block
fi: Edellinen lohko

source: Protocol version
fi: Protokollan versio

source: Proxy setting
fi: Välityspalvelinasetus

source: Raw transaction data
fi: Raaka siirtodata

source: Raw transaction data must be a valid hexadecimal string.
fi: Raa'an siirtodatan täytyy olla käypää heksadesimaalimuotoa.

source: Received Time
fi: Saapumisaika

source: Redirecting...
fi: Uudelleenohjataan...

source: Search for block, transaction or address
fi: Etsi lohkoa, siirtoa tai osoitetta

source: See all blocks
fi: Näytä kaikki lohkot

source: Send transaction
fi: Lähetä

source: Show Transaction Output data
fi: Näytä siirron ulostulo

source: Show all
fi: Näytä kaikki

source: Show input
fi: Näytä sisääntulo

source: Show less
fi: Näytä vähemmän

source: Show more
fi: Näytä enemmän

source: Signature
fi: Allekirjoitus

source: Size
fi: Koko

source: Size (bytes)
fi: Koko (tavua)

source: Skipped Blocks (previously synced)
fi: Ohitetut lohkot (aikaisemmin synkronoitu)

source: Start Date
fi: Aloituspäivämäärä

source: Status
fi: Tila

source: Summary
fi: Yhteenveto

source: Summary <small>confirmed</small>
fi: Yhteenveto <small>vahvistettu</small>

source: Sync Progress
fi: Synkronoinnin eteneminen

source: Sync Status
fi: Synkronoinnin tila

source: Sync Type
fi: Synkronoinnin tyyppi

source: Synced Blocks
fi: Synkronoituja lohkoja

source: Testnet
fi: Testiverkko

source: The message failed to verify.
fi: Viestin varmistus epäonnistui.

source: The message is verifiably from {{verification.address}}.
fi: Viesti saapui varmennettavasti osoitteesta {{verification.address}}.

source: There are no transactions involving this address.
fi: Kyseistä osoitetta koskevia siirtoja ei löytynyt.

source: This form can be used to broadcast a raw transaction in hex format over the Bitcoin network.
fi: Tätä lomaketta voi käyttää raa'an transaktion kuuluttamiseen Bitcoin-verkkoon.

source: This form can be used to verify that a message comes from a specific Bitcoin address.
fi: Tätä lomaketta voi käyttää vahvistaakseen viestin tulevan tietystä Bitcoin-osoitteesta.

source: Time Offset
fi: Aikaero

source: Timestamp
fi: Aikaleima

source: Today
fi: Tänään

source: Total Amount
fi: Kokonaismäärä

source: Total Received
fi: Saapuneet yhteensä

source: Total Sent
fi: Lähetetyt yhteensä

source: Transaction
fi: Siirto

source: Transaction Output Set Information
fi: Siirron ulostulon tiedot

source: Transaction Outputs
fi: Siirron ulostuloja

source: Transaction succesfully broadcast.<br>Transaction id: {{txid}}
fi: Siirto kuulutettu onnistuneesti.<br>Siirron tunniste: {{txid}}

source: Transactions
fi: Siirtoja

source: Type
fi: Tyyppi

source: Unconfirmed
fi: Vahvistamatta

source: Unconfirmed Transaction!
fi: Vahvistamaton siirto!

source: Unconfirmed Txs Balance
fi: Vahvistamattomien siirtojen kate

source: Value Out
fi: Lähetetty määrä

source: Hash
fi: Tiiviste

source: Verify
fi: Vahvista

source: Verify signed message
fi: Vahvista allekirjoitettu viesti

source: Version
fi: Versio

source: Waiting for blocks...
fi: Odotetaan lohkoja...

source: Waiting for transactions...
fi: Odotetaan siirtoja...

source: by date.
fi: ajan mukaan

source: first seen at
fi: havaittu ensin

source: mined
fi: louhittu

source: mined on:
fi: louhittu:

source: Scan
fi: Skannaa

source: BlockHash
fi: Lohkon tiiviste

source: Merkle Root
fi: Merkle-puu

source: Nonce
fi: Nonssi

source: broadcast transaction
fi: kuuluta transaktio

source: verify message
fi: varmista viesti
